Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.4.76/samc20/edc/ATSAMC20E16A.PIC
      <edc:SFRDef edc:_addr="0x4000141C" edc:access="----------------n--nnnnn--------" edc:cname="OSCULP32K" edc:impl="0x9F00" edc:nzwidth="0x20" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:desc="Oscillator Calibration" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001420" edc:offset="0x3E0"/>
      <edc:SFRDef edc:_addr="0x40001800" edc:access="--------------------------nnnnnn" edc:cname="INTENCLR" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BODVDDRDY" edc:desc="BODVDD Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODVDDDET" edc:desc="BODVDD Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BVDDSRDY" edc:desc="BODVDD Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCORERDY" edc:desc="BODCORE Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCOREDET" edc:desc="BODCORE Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCORESRDY" edc:desc="BODCORE Synchronization Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001804" edc:access="--------------------------nnnnnn" edc:cname="INTENSET" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BODVDDRDY" edc:desc="BODVDD Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODVDDDET" edc:desc="BODVDD Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BVDDSRDY" edc:desc="BODVDD Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCORERDY" edc:desc="BODCORE Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCOREDET" edc:desc="BODCORE Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCORESRDY" edc:desc="BODCORE Synchronization Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001808" edc:access="--------------------------nnnnnn" edc:cname="INTFLAG" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BODVDDRDY" edc:desc="BODVDD Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODVDDDET" edc:desc="BODVDD Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BVDDSRDY" edc:desc="BODVDD Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCORERDY" edc:desc="BODCORE Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCOREDET" edc:desc="BODCORE Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCORESRDY" edc:desc="BODCORE Synchronization Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000180C" edc:access="--------------------------rrrrrr" edc:cname="STATUS" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BODVDDRDY" edc:desc="BODVDD Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODVDDDET" edc:desc="BODVDD Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BVDDSRDY" edc:desc="BODVDD Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCORERDY" edc:desc="BODCORE Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCOREDET" edc:desc="BODCORE Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCORESRDY" edc:desc="BODCORE Synchronization Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001810" edc:access="----------nnnnnnnnnn---n-nnnnnn-" edc:cname="BODVDD" edc:impl="0x3FF17E" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:desc="Hysteresis Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:desc="Action when Threshold Crossed" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="The BODVDD generates a reset" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="The BODVDD generates an interrupt" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STDBYCFG" edc:desc="Configuration in Standby mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTCFG" edc:desc="Configuration in Active mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PSEL" edc:desc="Prescaler Select" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide clock by 2" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide clock by 4" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide clock by 8" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide clock by 16" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide clock by 32" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide clock by 64" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide clock by 128" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide clock by 256" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="Divide clock by 512" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide clock by 1024" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV2048" edc:desc="Divide clock by 2048" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="DIV4096" edc:desc="Divide clock by 4096" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="DIV8192" edc:desc="Divide clock by 8192" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="DIV16384" edc:desc="Divide clock by 16384" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="DIV32768" edc:desc="Divide clock by 32768" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="DIV65536" edc:desc="Divide clock by 65536" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:desc="Threshold Level for VDD" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
